openenergymonitor/STM32/Software/Sombrero_VE_Working6/Src/main.c
	  volatile uint32_t write_cnt=0, index=0;

	  volatile HAL_StatusTypeDef status;
	  status = HAL_FLASHEx_Erase(&EraseInitStruct, &PageError);
	  while(index < data_length)
	  {
		  if (status == HAL_OK)
		  {
			  status = HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, FLASH_STORAGE+write_cnt, data_to_FLASH[index]);
			  if(status == HAL_OK)
			  {
				  write_cnt += 4;
				  index++;
			  }
		  }
	  }

	  HAL_FLASH_OB_Lock();
	  HAL_FLASH_Lock();
}

void read_flash(uint8_t* data)
{
	volatile uint32_t read_data;
	volatile uint32_t read_cnt=0;
	do
	{
		read_data = *(uint32_t*)(FLASH_STORAGE + read_cnt);
		if(read_data != 0xFFFFFFFF)
		{
			data[read_cnt] = (uint8_t)read_data;
			data[read_cnt + 1] = (uint8_t)(read_data >> 8);
			data[read_cnt + 2] = (uint8_t)(read_data >> 16);
			data[read_cnt + 3] = (uint8_t)(read_data >> 24);
			read_cnt += 4;
		}
	} while(read_data != 0xFFFFFFFF);
}

typedef struct {
  int reset_counter; 
  //uint32_t uptime;
  //double temperature;   // other data
} FlashStruct; 

FlashStruct flash_struct;


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
  V_RATIO = VCAL * VOLTS_PER_DIV;
  I_RATIO = ICAL * VOLTS_PER_DIV;
  
  //FlashStruct *flashpt = &flash_struct;
  //union Un flashUn; 

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */
  
  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART2_UART_Init();
  MX_TIM8_Init();
  MX_ADC1_Init();
  MX_USART1_UART_Init();
  MX_TIM16_Init();
  MX_SPI1_Init();
  MX_SPI4_Init();
  MX_UART4_Init();
  MX_USART3_UART_Init();
  MX_I2C3_Init();
  MX_UART5_Init();
  MX_RTC_Init();
  MX_ADC3_Init();
  MX_OPAMP4_Init();
  MX_ADC4_Init();
  MX_USB_PCD_Init();
  MX_CAN_Init();
  MX_ADC2_Init();
  /* USER CODE BEGIN 2 */



  //------------------------
  // UART DMA RX ENABLE
  //------------------------
  __HAL_UART_ENABLE_IT(&huart1, UART_IT_IDLE);
  HAL_UART_Receive_DMA(&huart1, rx_buff, sizeof(rx_buff));
  __HAL_UART_ENABLE_IT(&huart2, UART_IT_IDLE);
  HAL_UART_Receive_DMA(&huart2, rx_buff, sizeof(rx_buff));
  //------------------------------
  // UART Non-blocking TX ENABLE
  //------------------------------
  __HAL_UART_ENABLE_IT(&huart1, UART_IT_TC); // necessary only to know if we're good to fire another Tx soon after a HAL_UART_Transmit_IT()
  __HAL_UART_ENABLE_IT(&huart2, UART_IT_TC);  
          // usart1_rx_flag = 1; // debugging

  //debug_printf("\r\n\r\nStart, connect VT.\r\n");
  char stratLine[] = "\r\n\r\nStart, connect VT.\r\n";
  HAL_UART_Transmit_IT(&huart2, (uint8_t*)stratLine, strlen(stratLine));



  //-------------------------------------------------
  // Analog Input RNG for Radio Start Delay
  //-------------------------------------------------
  if (radioSend) {  
    int RadDelayCount = 0;
    int RadioDelay;
    while(RadDelayCount < 3) {
      static int reading;
      static int previousRadDelay;
      previousRadDelay = reading;
      
      // ADC read start
      HAL_ADC_Start(&hadc3);
      while (HAL_ADC_PollForConversion(&hadc3, 1000) != HAL_OK) {__NOP();}
      reading = HAL_ADC_GetValue(&hadc3);
      HAL_ADC_Stop(&hadc3);
      // ADC read end.
      
      RadioDelay = abs((reading - previousRadDelay + 400) * 10); // scale the 'noise'.
      HAL_Delay(100);
      RadDelayCount++;
    }
    sprintf(log_buffer, "RadioDelay:%d\r\n", RadioDelay);
    debug_printf(log_buffer); 
    HAL_Delay (RadioDelay);

    log_buffer[0] = '\0'; // clear buffer.
  } // end RadioDelay.


  //------------------------
  // RTC Backup Registers
  //------------------------
  // RTC backup register test, 16 x 32-bit addresses available.
  // see stm32f3xx_hal_rtc_ex.c  line 1118 onwards.
  //uint32_t bkp_write = 123456789;
  uint32_t bkp_ = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR0);
  sprintf(log_buffer, "Number of boots:%ld\r\n", bkp_);
  debug_printf(log_buffer); log_buffer[0] = 0;
  boot_number = bkp_;
  HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR0, bkp_+1);
  // works!
  
  // RESET CAUSE
  reset_cause_store = reset_cause_get();
  sprintf(log_buffer, "Reset Cause:%s\r\n", reset_cause_get_name(reset_cause_store));
  debug_printf(log_buffer); log_buffer[0] = 0;
  
  
  //------------------------
  // EEPROM Emulation test
  //------------------------
  /*
  char write_data_pgm[50];
  strcpy(write_data_pgm, "Hellow from Flash Memory!\r\n");
  save_to_flash((uint8_t*) write_data_pgm);
  char read_data_pgm[50];
  read_flash((uint8_t*)read_data_pgm);
  debug_printf(read_data_pgm); // print result
  
  float write_float_pgm = 123.321f;
  float *pointer_write_float = &write_float_pgm;
  save_to_flash((uint8_t*)pointer_write_float);
  float read_float_pgm = 0.0;
  float *pointer_read_float = &read_float_pgm;
  read_flash((uint8_t*)pointer_read_float);
  //char log_buffer[20];
  sprintf(log_buffer, "Float value also read from flash memory! %.3f\r\n", read_float_pgm);
  debug_printf(log_buffer); log_buffer[0] = 0; // print result
  */

  // int test_array_mode[5] = {2,1,3,4,5};
  // sprintf(log_buffer, "test mode-finding: %d\r\n", findmode(test_array_mode, 5));
  // debug_printf(log_buffer); log_buffer[0] = 0; // print result
  // seems findmode() will return the first value of the array if no mode value is found.


  //------------------------
  // is the rPi Connected?
  //------------------------
  if (HAL_GPIO_ReadPin(rPi_PWR_GPIO_Port, rPi_PWR_Pin) == 1)
  {
    debug_printf("rPi connected!\r\n");
    _mode = 1;
  }
  else {
    debug_printf("rPi not connected.\r\n");
    // _mode = 0;
  }


  //------------------------
  // RADIO Init
  //------------------------
  RFM69_RST();
  HAL_Delay(20);
  if (RFM69_initialize(freqBand, nodeID, networkID))
  {
    sprintf(log_buffer, "RFM69 Initialized. Freq %dMHz. Node %d. Group %d.\r\n", freqBand, nodeID, networkID);
    debug_printf(log_buffer);
    log_buffer[0] = '\0';
    //RFM69_readAllRegs(); // debug output
  }
  else debug_printf("RFM69 not connected.\r\n");
  
  // if we have a encryption key, radio encryption will be set.
  if (encryptkey[0]) RFM69_encrypt(encryptkey);

  if (radioReceive || radioSend) {
    __NOP();
  }
  else {
    HAL_SPI_MspDeInit(&hspi4); // disable SPI4, for testing.
    debug_printf("SPI4 DeInit'd.\r\n");
  }
  //else {
  //RFM69_interruptHandler();
  //RFM69_receiveDone();
  //}


  //------------------------
  // ADC & OPAMP Start
  //------------------------
  HAL_ADCEx_Calibration_Start(&hadc1, ADC_SINGLE_ENDED);
  HAL_ADCEx_Calibration_Start(&hadc3, ADC_SINGLE_ENDED);
  HAL_Delay(2);
  //HAL_OPAMP_SelfCalibrate(&hopamp4);
  HAL_OPAMP_Start(&hopamp4);
  HAL_Delay(2);
  start_ADCs(usec_lag);

  //init_ds18b20s(); // temperature sensor

  debug_printf("\r\n");
  
  /* USER CODE END 2 */

