openenergymonitor/STM32/Software/Sombrero_VE_Working6/Src/main.c
  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    current_millis = HAL_GetTick();

    // process_ds18b20s();
    
    //---------------------------------------
    // Interval for posting power readings.
    //---------------------------------------
    if (current_millis - previous_millis >= posting_interval) 
    {
      uint32_t correction = current_millis - previous_millis - posting_interval;
      previous_millis = current_millis - correction;

      //RTC_CalendarShow(aShowTime, aShowDate);
      //debug_printf((char*)aShowDate); debug_printf("\r\n");
      //debug_printf((char*)aShowTime); debug_printf("\r\n");

      if (readings_requested) debug_printf("No voltage waveform present.\r\n");
      //if (testing) goto debugIrms;
      // implement default Vrms value setting and automatic calc of Irms and approximated Power value?
      readings_requested = true;
    }
    

    //------------------------------------------------
    // ADC DMA buffer flags. Process Frames.
    //------------------------------------------------
    if (conv_hfcplt_flag)
    {
      conv_hfcplt_flag = false;
      process_frame(0); // process 1st half of buffer.
    }
    if (conv_cplt_flag)
    {
      conv_cplt_flag = false;
      process_frame(adc_buff_half_size); // process 2nd half of buffer.
    }
    // HAL_Delay(200); // ADC buffer overrun flag test.


    //------------------------------------------------
    // To post primary data.
    //------------------------------------------------
    if (readings_ready)
    {
      readings_ready = false; memset(channel_rdy_bools, 0, sizeof(channel_rdy_bools)); // clear flags.
      if (!first_readings) { first_readings = true; goto EndJump; } // discard the first set as beginning of 1st waveform not tracked.
      
      if(ledBlink){HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_SET); } // blink the led
      
      sprintf(readings_rdy_buffer, "STM:1.0,"); // initital write to buffer.
      readings_rdy_buffer[0] = '\0'; // initital write to buffer.

      // CALCULATE POWER
      for (int ch = 0; ch < CTn; ch++)
      {
        channel_t *chn = &channels_ready[ch];

        last_powerFactor[ch] = powerFactor_now[ch];
        calcPower(ch);
        powerFactor_now[ch] = powerFactor;
        pfHunt(ch);

        if (ch == 0) { // estimate mains_frequency on a single channel, no need for more.
          mains_frequency = 1.0/(((chn->count * CTn) / chn->cycles) * adc_conversion_time);
        }

        int _ch = ch + 1; // nicer looking channel numbers. 1 starts at 1 instead of 0.
        if (_ch == 1) { // single channel debug output.
          sprintf(string_buffer, "V%d:%.2lf,I%d:%.3lf,AP%d:%.1lf,RP%d:%.1lf,PF%d:%.6lf,Joules%d:%.3lf,Clip%d:%d,cycles%d:%ld,samples%d:%ld,\r\n", _ch, Vrms, _ch, Irms, _ch, apparentPower, _ch, realPower, _ch, powerFactor, _ch, Ws_accumulator[ch], _ch, chn->Iclipped, _ch, chn->cycles, _ch, chn->count);
          strcat(readings_rdy_buffer, string_buffer);
        } // single channel debug output.
      }

      // Main frequency estimate.
      sprintf(string_buffer, "Hz_estimate:%.1f,", mains_frequency);
      if (_mode == 1) strcat(readings_rdy_buffer, string_buffer);
      
      // Millis
      sprintf(string_buffer, "millis:%ld,", current_millis);
      if (_mode == 1) strcat(readings_rdy_buffer, string_buffer);
      
      // Pulsecount
      sprintf(string_buffer, "PC:%ld,", pulseCount);
      if (_mode == 1) strcat(readings_rdy_buffer, string_buffer);
      
      // has the adc buffer overrun?
      sprintf(string_buffer, "buffOverrun:%d", adc_buffer_overflow);
      adc_buffer_overflow = 0; // reset
      if (_mode == 1) strcat(readings_rdy_buffer, string_buffer);


      // close the string and add some whitespace for clarity.
      if (_mode == 1) strcat(readings_rdy_buffer, "\r\n");
      debug_printf(readings_rdy_buffer); readings_rdy_buffer[0] = '\0';

      // RFM69 send.
      if (radioSend) // sending data, test data only.
      {
        radioData.nodeId = nodeID;
        radioData.uptime = HAL_GetTick();
        if(ledBlink){HAL_GPIO_WritePin(GPIOD, GPIO_PIN_8, 1); HAL_TIM_Base_Start_IT(&htim16); }// LED blink
        RFM69_send(toAddress, (const void *)(&radioData), sizeof(radioData), requestACK);
        //RFM69_sendWithRetry(toAddress, (const void *)(&radioData), sizeof(radioData), 3,20);
      }

      if(ledBlink){HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_RESET);}
    } EndJump: // end main readings_ready function.
    // end main readings_ready function.
    // end main readings_ready function.
    // end main readings_ready function.



    //-------------------------------
    // RFM69 Rx
    //-------------------------------
    // This needs checking, does a flag need generating from a DIO0 read = true?
    // Would a flat reduce the SPI business.?
    if(radioReceive) {
      if (RFM69_ReadDIO0Pin()) {
        debug_printf("RFM69 DIO0 high.\r\n");
        //RFM69_interruptHandler();
        if (RFM69_receiveDone()) { // this maybe shouldn't be nested in the previous if(). If Rx doesn't work, could be the problem.
          HAL_GPIO_WritePin(GPIOD, GPIO_PIN_8, 1); // LED blink
          HAL_TIM_Base_Start_IT(&htim16); // LED blink, interrupt based.
          // debug output below.
          debug_printf("RFM69 payload received.\r\n");
          PrintRawBytes();
          //PrintStruct();
          //PrintByteByByte();
          //RFM69_interruptHandler();
          sprintf(log_buffer, "RSSI:%d\r\n", rssi);
          debug_printf(log_buffer);

          RFM69_receiveBegin();
          //RFM69_receiveDone(); // seems to be required.
          log_buffer[0] = '\0';
        }
      }
    } // end radioReceive


    
    /*  // below for testing radio Noise
    if (radioSend) // sending data, test data only.
      {
        HAL_GPIO_WritePin(GPIOD, GPIO_PIN_8, 1); // LED blink
        HAL_TIM_Base_Start_IT(&htim16); // LED blink, interrupt based.
        radioData.nodeId = nodeID;
        radioData.uptime = HAL_GetTick();
        if(ledBlink){HAL_GPIO_WritePin(GPIOD, GPIO_PIN_8, 1); HAL_TIM_Base_Start_IT(&htim16); }// LED blink
        RFM69_send(toAddress, (const void *)(&radioData), sizeof(radioData), requestACK);
        //RFM69_sendWithRetry(toAddress, (const void *)(&radioData), sizeof(radioData), 3,20);
      }
    */



    //------------------------
    // UART Rx check
    //------------------------
    if (usart1_rx_flag)
    {
      usart1_rx_flag = 0;
      memcpy(rx_string, rx_buff, sizeof(rx_buff));
      memset(rx_buff, 0, sizeof(rx_buff));
      huart1.hdmarx->Instance->CCR &= ~DMA_CCR_EN;
      huart1.hdmarx->Instance->CNDTR = sizeof(rx_buff);
      huart1.hdmarx->Instance->CCR |= DMA_CCR_EN; // reset dma counter
      //json_parser("{G:RTC}"); // calling this loads json_response[] with a response.
      json_parser(rx_string); // calling this loads json_response[] with a response.
      sprintf(log_buffer, "{STM32:%s}\r\n", json_response);
    }
    if (usart2_rx_flag)
    {
      //-----
        //phase_corrections[0] = 13; // slap a value in there to test with.
        //hunt_PF[0] = true; // test powerfactor hunting on CT1.
      //-----
      usart2_rx_flag = 0;
      memcpy(rx_string, rx_buff, sizeof(rx_buff));
      memset(rx_buff, 0, sizeof(rx_buff));
      huart2.hdmarx->Instance->CCR &= ~DMA_CCR_EN;
      huart2.hdmarx->Instance->CNDTR = sizeof(rx_buff);
      huart2.hdmarx->Instance->CCR |= DMA_CCR_EN; // reset dma counter
      json_parser(rx_string); // calling this loads json_response[] with a response.
      sprintf(log_buffer, "{STM32:%s}\r\n", json_response);
    }


    //-------------------------------
    // Print char buffers to serial.
    //-------------------------------
    if (log_buffer[0] != '\0') { // null terminated strings!
      rPi_printf(log_buffer);
      log_buffer[0] = '\0'; // set index of string to null to effectively delete the string.
      // https://stackoverflow.com/questions/632846/clearing-a-char-array-c
    }
    if (readings_rdy_buffer[0] != '\0') {
      rPi_printf(readings_rdy_buffer);
      readings_rdy_buffer[0] = '\0';
    }
    

  /* USER CODE END WHILE */

